Website-Pompong/app/Controllers/Admin.php

    public function index()
    {
        $data = [
            'title'      => 'Dashboard - Admin PuWu',
            'active_menu'=> 'dashboard',
            'stok'       => $this->pengaturanModel->getStok(),
            'total_trx'  => $this->transaksiModel->countAll(),
            // Hanya ambil 2 transaksi terbaru
            'recent_trx' => $this->transaksiModel->orderBy('created_at', 'DESC')->findAll(2)
---
SELECT COUNT(*) AS `numrows` FROM `transaksi`
SELECT *
FROM `transaksi`
ORDER BY `created_at` DESC
 LIMIT 2

    public function transaksi()
    {
        $keyword = $this->request->getGet('keyword');
        $builder = $this->transaksiModel->orderBy('created_at', 'DESC');

        if ($keyword) {
            $builder->groupStart()
                    ->like('nama_penumpang', $keyword)
                    ->orLike('tiket_id', $keyword)
                    ->groupEnd();
        }

        $data = [
            'title'       => 'Riwayat Transaksi - Admin PuWu',
            'active_menu' => 'transaksi',
            'transaksi'   => $builder->findAll(),
---
SELECT *
FROM `transaksi`
ORDER BY `created_at` DESC