Website-Pompong/app/Controllers/Home.php

INSERT INTO `transaksi` (`tiket_id`, `nama_penumpang`, `jenis_kelamin`, `tujuan`, `harga`, `created_at`, `updated_at`) VALUES ('PN-543512HLF', 'rahmat tahalu', 'Laki-laki', 'Tanjung Pinang → Pulau Penyengat', 8000, '2025-12-04 04:29:03', '2025-12-04 04:29:03')
---
    public function pesan()
    {
        $pengaturanModel = new PengaturanModel();
        $transaksiModel  = new TransaksiModel();

        // Terima data JSON dari Javascript
        $json = $this->request->getJSON();

        if (!$json) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Data tidak valid']);
        }

        // Mulai Database Transaction (Agar aman dari rebutan stok)
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // 1. Cek Stok (Lock Row untuk keamanan concurrency)
            // Di CI4 basic kita cek manual saja dulu
            $stokSekarang = $pengaturanModel->getStok();

            if ($stokSekarang <= 0) {
                throw new \Exception("Mohon maaf, tiket sudah habis!");
            }

            // 2. Kurangi Stok
            $pengaturanModel->updateStok($stokSekarang - 1);

            // 3. Simpan Transaksi
            $transaksiModel->save([
                'tiket_id'       => $json->tiketId,
                'nama_penumpang' => $json->nama,
                'jenis_kelamin'  => $json->kelamin,
                'tujuan'         => $json->tujuan,
                'harga'          => 8000
            ]);