Website-Pompong/app/Controllers/Login.php

SELECT *
FROM `admin_users`
WHERE `username` = 'admin'
---
    public function process()
    {
        $session = session();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $db = \Config\Database::connect();
        $user = $db->table('admin_users')->where('username', $username)->get()->getRowArray();