Website-Pompong/app/Models/PengaturanModel.php

    public function getStok()
    {
        $data = $this->where('nama_setting', 'stok_pompong')->first();
---
SELECT *
FROM `pengaturan`
WHERE `nama_setting` = 'stok_pompong'
 LIMIT 1

    public function updateStok($nilaiBaru)
    {
        return $this->where('nama_setting', 'stok_pompong')
                    ->set(['nilai' => $nilaiBaru])
                    ->update();
---
UPDATE `pengaturan` SET `nilai` = 9
WHERE `nama_setting` = 'stok_pompong'